Dlubal.RFEM5.IModel
Interface for working with model.

Dlubal.RFEM5.IModel.GetApplication
Gets interface for working with application.
Returns: Application interface

Dlubal.RFEM5.IModel.GetName
Gets model name.
Returns: Model name.

Dlubal.RFEM5.IModel.SetName(System.String)
Sets model name.
Name: Model name to be set.

Dlubal.RFEM5.IModel.GetDescription
Gets model description.
Returns: Model description

Dlubal.RFEM5.IModel.SetDescription(System.String)
Sets model description.
Description: Model description to be set.

Dlubal.RFEM5.IModel.GetComment
Gets model comment.
Returns: Model comment

Dlubal.RFEM5.IModel.SetComment(System.String)
Sets model comment.
Comment: Model comment to be set.

Dlubal.RFEM5.IModel.GetID
Gets model ID.
Returns: Model ID

Dlubal.RFEM5.IModel.SetID(System.String)
Sets model ID.
ID: Model ID to be set.

Dlubal.RFEM5.IModel.GetPath
Gets the path to the current model file.
Returns: Path to the model file.

Dlubal.RFEM5.IModel.GetTempFolderPath
Gets the path to the folder where the model has it's temporary data.
Returns: Path to the temporary folder.

Dlubal.RFEM5.IModel.Save(System.String)
Saves model.
Path: Path where the model will be written.

Dlubal.RFEM5.IModel.Close
Closes the model.

Dlubal.RFEM5.IModel.Activate
Activates the model.

Dlubal.RFEM5.IModel.SetModified
Sets the model as modified.

Dlubal.RFEM5.IModel.Clean
Cleans all model objects.

Dlubal.RFEM5.IModel.GetProjectName
Gets the project name.
Returns: Project name

Dlubal.RFEM5.IModel.GetProjectDescription
Gets the project description.
Returns: Project description

Dlubal.RFEM5.IModel.GetProjectPath
Gets the path to the project folder.
Returns: Path to the project folder.

Dlubal.RFEM5.IModel.GetGlobalZAxisOrientation
Gets positive orientation of global Z-axis.
Returns: Orientation of global Z-axis.

Dlubal.RFEM5.IModel.SetGlobalZAxisOrientation(System.UInt32,System.Boolean)
Sets positive orientation of global Z-axis.
Orientation: Orientation of global Z-axis to be set.
Recalculate: Recalculated the model?

Dlubal.RFEM5.IModel.GetLocalZAxisOrientation
Gets orientation of local z-axis.
Returns: Orientation of localz-axis.

Dlubal.RFEM5.IModel.SetLocalZAxisOrientation(System.UInt32)
Sets orientation of local z-axis.
Orientation: Orientation of local z-axis to be set.

Dlubal.RFEM5.IModel.GetModelData
Gets interface for working with model data.
Returns: Model data interface

Dlubal.RFEM5.IModel.GetLoads
Gets interface for working with loads.
Returns: Loads interface

Dlubal.RFEM5.IModel.GetCalculation
Gets interface for working with calculation.
Returns: Calculation interface

Dlubal.RFEM5.IModel.GetGuideObjects
Gets interface for working with guide objects.
Returns: Guide objects interface

Dlubal.RFEM5.IModel.GetActiveView
Gets interface for working with active view.
Returns: View interface

Dlubal.RFEM5.IModel.GetModule(System.String)
Gets the module interface based on its name.
Returns: Interface to the selected module.
ModuleName: Name of the module.

Dlubal.RFEM5.IModel.GetWorkPlane
Gets work plane parameters.
Returns: Work plane parameters

Dlubal.RFEM5.IModel.SetWorkPlane(System.UInt32@)
Sets work plane parameters.
Plane: Work plane parameters

Dlubal.RFEM5.IModel.GetGrid
Gets grid parameters.
Returns: Grid parameters

Dlubal.RFEM5.IModel.SetGrid(System.UInt32@)
Sets grid parameters.
Grid: Grid parameters

Dlubal.RFEM5.IModel.GetProtocols
Gets interface for working with printout reports.
Returns:  Interface to class working with printout reports.